---
title: FabricationDimensionDefinition
classe: Autodesk.Revit.DB.FabricationDimensionDefinition
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# FabricationDimensionDefinition

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsModifiable { get; }` | `fabricationDimensionDefinition.IsModifiable` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationDimensionDefinition.IsValidObject` | Boolean |
| `String Name { get; }` | `fabricationDimensionDefinition.Name` | String |
| `FabricationDimensionType Type { get; }` | `fabricationDimensionDefinition.Type` | FabricationDimensionType |
| `FabricationDimensionUnitType UnitType { get; }` | `fabricationDimensionDefinition.UnitType` | FabricationDimensionUnitType |
| `Void Dispose()` | `fabricationDimensionDefinition.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```